In [1]:
import pandas as pd

#### Series

In [ ]:
# 1D data structure
# to create series use list /tuple 
# it cant handle mixed data types
# Series(values, index, dtype )

In [2]:
sr1 = pd.Series([10,20,30,40,50])
sr1

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [3]:
sr1[3]

40

In [4]:
sr2 = pd.Series([10,20,30,40,50], index = ['a','b','c','d','e'], dtype = float)
sr2

a    10.0
b    20.0
c    30.0
d    40.0
e    50.0
dtype: float64

In [5]:
sr2['c']

30.0

In [ ]:
# numbers: int/float; strings : objects

In [6]:
sr2.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [7]:
sr2.values

array([10., 20., 30., 40., 50.])

In [8]:
sr2.dtype

dtype('float64')

#### DataFrame

In [9]:
# 2D data structure / table --> rows and columns
# data frame is ideally created by combining multiple columns
# each column should have one data type # it cant handle mixed data types in single column like SQL table

In [10]:
dict1 = {
    'col1': [10,20,30,40,50],
    'col2': pd.Series(['a','b','c','d','e'])
}
df1 = pd.DataFrame(dict1)
df1

   col1 col2
0    10    a
1    20    b
2    30    c
3    40    d
4    50    e

In [18]:
df1.dtypes

col1     int64
col2    object
dtype: object

#### Merge

In [ ]:
# SQL JOIN == Pandas Merge

In [19]:
df1 = pd.DataFrame({'id': [1,2,3,4,5], 'stat_marks': [94,95,99,98,91]})
df2 = pd.DataFrame({'id': [3,4,5,6,7], 'ml_marks': [92,90,94,89,95]})
df2

   id  ml_marks
0   3        92
1   4        90
2   5        94
3   6        89
4   7        95

In [20]:
# to extract students data who appeared for both exams 
# select * from df1 join df2 on df1.id = df2.id

df1.merge(df2, on = 'id', how = 'inner')

   id  stat_marks  ml_marks
0   3          99        92
1   4          98        90
2   5          91        94

In [21]:
df1.merge(df2, on = 'id', how = 'left') # NaN --> SQL Null / empty

   id  stat_marks  ml_marks
0   1          94       NaN
1   2          95       NaN
2   3          99      92.0
3   4          98      90.0
4   5          91      94.0

In [22]:
df1.merge(df2, on = 'id', how = 'right')

   id  stat_marks  ml_marks
0   3        99.0        92
1   4        98.0        90
2   5        91.0        94
3   6         NaN        89
4   7         NaN        95

In [23]:
df1.merge(df2, on = 'id', how = 'outer')

   id  stat_marks  ml_marks
0   1        94.0       NaN
1   2        95.0       NaN
2   3        99.0      92.0
3   4        98.0      90.0
4   5        91.0      94.0
5   6         NaN      89.0
6   7         NaN      95.0

#### Concat

In [ ]:
# SQL UNION == Pandas concat

In [26]:
df1 = pd.DataFrame({'id': [1,2,3,4,5], 'stat_marks': [94,95,99,98,91]})
df2 = pd.DataFrame({'id': [6,7,8,9,10], 'stat_marks': [92,90,94,89,95]})

pd.concat([df1,df2])

   id  stat_marks
0   1          94
1   2          95
2   3          99
3   4          98
4   5          91
0   6          92
1   7          90
2   8          94
3   9          89
4  10          95

In [27]:
df1 = pd.DataFrame({'id': [1,2,3,4,5], 'stat_marks': [94,95,99,98,91]})
df2 = pd.DataFrame({'id': [6,7,8,9,10], 'ml_marks': [92,90,94,89,95]})

pd.concat([df1,df2])

   id  stat_marks  ml_marks
0   1        94.0       NaN
1   2        95.0       NaN
2   3        99.0       NaN
3   4        98.0       NaN
4   5        91.0       NaN
0   6         NaN      92.0
1   7         NaN      90.0
2   8         NaN      94.0
3   9         NaN      89.0
4  10         NaN      95.0

In [28]:
pwd

'/Users/trainer/30-08-2025_8pm'

In [ ]:
# keep auto.csv in the above folder

In [29]:
df1 = pd.read_csv('Auto.csv')
df1.head()

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name
0,18.0,8.0,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8.0,350.0,165,3693,11.5,70,1,buick skylark 320
2,NaN,8.0,318.0,150,3436,11.0,70,1,plymouth satellite
3,NaN,8.0,NaN,150,3433,12.0,70,1,amc rebel sst
4,NaN,8.0,NaN,140,3449,10.5,70,1,ford torino

In [ ]:
# Jupyter Notebook / Spyder/ pycharm / vs code